In [20]:
# Pandas - Data Drames Part 2

In [21]:
import numpy as np
import pandas as pd

In [22]:
from numpy.random import randn

In [23]:
np.random.seed(101)

In [24]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
#conditional selection

In [27]:
 df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [28]:
df >1

       W      X      Y      Z
A   True  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False   True   True  False

In [29]:
booldf = df > 0

In [30]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [31]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df['W'] >0 # here you can get false

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [34]:
df['W'] # you can compare it wiith this why it is falseand

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
#now you can get series values that means only the true values no any false values

In [36]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [39]:
resultdf = df[df['W']>0]

In [41]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [43]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [49]:
boolser = df['W']>0
result = df[boolser]
mycols = ['Y', 'X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [53]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [57]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [59]:
df[(df['W']>0) and (df['Y']>1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [62]:
#in above code we can see that because of using "and "ther is an error because and of confused of using multim[ple conditions. so, instead we will use "&"

In [61]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [63]:
# for OR operation we use Pipe ie "|"

In [64]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
df # df means data frame

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [67]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [68]:
#to put index permanently use "inplace=true" inside index

In [69]:
newind = 'CA NY WY OR CO'.split()

In [71]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [72]:
df['States'] = newind

In [73]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [74]:
newlin = 'OA PA CA HP HA'.split()

In [75]:
newlin

['OA', 'PA', 'CA', 'HP', 'HA']

In [76]:
df['member'] = newlin

In [77]:
df

          W         X         Y         Z States member
A  2.706850  0.628133  0.907969  0.503826     CA     OA
B  0.651118 -0.319318 -0.848077  0.605965     NY     PA
C -2.018168  0.740122  0.528813 -0.589001     WY     CA
D  0.188695 -0.758872 -0.933237  0.955057     OR     HP
E  0.190794  1.978757  2.605967  0.683509     CO     HA

In [78]:
df.set_index('States')

               W         X         Y         Z member
States
CA      2.706850  0.628133  0.907969  0.503826     OA
NY      0.651118 -0.319318 -0.848077  0.605965     PA
WY     -2.018168  0.740122  0.528813 -0.589001     CA
OR      0.188695 -0.758872 -0.933237  0.955057     HP
CO      0.190794  1.978757  2.605967  0.683509     HA

In [79]:
df

          W         X         Y         Z States member
A  2.706850  0.628133  0.907969  0.503826     CA     OA
B  0.651118 -0.319318 -0.848077  0.605965     NY     PA
C -2.018168  0.740122  0.528813 -0.589001     WY     CA
D  0.188695 -0.758872 -0.933237  0.955057     OR     HP
E  0.190794  1.978757  2.605967  0.683509     CO     HA